# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх 
# одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть.


n = int(input('Введите количество монеток:'))
orel = 0 
reshka = 0 
for i in range(n):
    i = int(input('Введите значение монетки : 0 - решка, 1- орел: '))
    if i == 0:
       reshka += 1
    else:
       orel += 1
if orel > reshka:
    print(reshka)
else:
    print(orel)


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

s = (int(input('Введите сумму чисел:')))
p = (int(input('Введите произведение чисел:')))
for x in range (s):
    for y in range (p):
        if s == x + y and p == x * y:
           print(x, y)
           break
           


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

N = (int(input('Введите число:')))
k = 0
while (2 ** k) <= N:
    print(2 ** k)
    k+=1
